// Напишите программу, которая принимает на вход координаты точки (X и Y), 
// причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка.

// System coordinate
// x > 0, y > 0 I quater
// x > 0, y < 0 IV quater
// x < 0, y < 0 III quater
// x < 0, y > 0 II quater


void FunktName1 ()    // Имя метода + (аргумент)
{
    Console.WriteLine ("Input");
    int number = Convert.ToInt32 (Console.ReadLine ());
   int del = arg1 % arg2;
   Console.WriteLine("1 " + del);
}

NameFunk1(number, 9);     // вызов метода + (аргумент)




int, (bool, double, string) (int arg1, int arg2, bool arg3.........);
{
    arg1 = number;
    arg2 = 9;
    int del = arg1 % arg2;

    return _____;
}

Console.WriteLine ("Input");
int number = Convert.ToInt32 (Console.ReadLine ());
// NameFunk(number, 9);

int result = FunktName(number, 9);
Console.WriteLine (FunktName (number, 9));

int result1 = FunktName(1000, 78);
Console.WriteLine("1 " + result1);

