// Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно 7 и 23.

void crat()
{
    Console.Write("Enter first number ");
    int first = Convert.ToInt32(Console.ReadLine());
    int result = 0;

    if  (result = (num1 % 7 == 0 && num1 % 23 == 0)   
{       


        Console.WriteLine("Второе кратно первому");

    else
        Console.WriteLine(second % first);


}
}
crat();